{
  "general": {
    "logo_v1_light": "assets/logos/logo_v1_light.svg",
    "logo_v1_dark": "assets/logos/logo_v1_dark.svg",
    "logo_v2_light": "assets/logos/logo_v2_light_en.svg",
    "logo_v2_dark": "assets/logos/logo_v2_dark_en.svg"
  },
  "nav": {
    "home": "Home",
    "about-me": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact",
    "logo_v1_light": "assets/logos/logo_v1_light.svg",
    "logo_v1_dark": "assets/logos/logo_v1_dark.svg"
  },
  "home": {
    "headline": ""
  },
  "about-me": {
    "headline": "About"
  },
  "skills": {
    "headline": "My Skills"
  },
  "projects": {
    "headline": "My Projects"
  },
  "contact": {
    "headline": "Contact"
  },
  "footer": {
    "headline": ""
  },
  "imprint": {
    "headline": "Imprint",
    "legal_info": "Information according to § 5 DDG",
    "name": "Veysel Karaali",
    "address_line1": "Kettelerstraße 17",
    "address_line2": "73431 Aalen",
    "represented_by": "Represented by:",
    "representative_name": "Veysel Karaali",
    "contact": "Contact:",
    "phone": "Phone: +4917682926686",
    "email": "Email",
    "liability_content": "Liability for Content",
    "liability_content_text": "The contents of our pages were created with great care. However, we cannot assume any liability for the correctness, completeness, and up-to-dateness of the contents. As a service provider, we are responsible for our own content on these pages in accordance with general laws as per § 7 Abs.1 DDG. According to §§ 8 to 10 DDG, however, we are not obligated to monitor transmitted or stored external information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information under general laws remain unaffected. However, liability in this regard is only possible from the time of knowledge of a specific infringement. Upon becoming aware of corresponding legal violations, we will remove these contents immediately.",
    "liability_links": "Liability for Links",
    "liability_links_text": "Our offer contains links to external third-party websites, the contents of which we have no influence on. Therefore, we cannot assume any liability for these external contents. The respective provider or operator of the sites is always responsible for the contents of the linked sites. The linked sites were checked for possible legal violations at the time of linking. Illegal content was not recognizable at the time of linking. A permanent content control of the linked sites is not reasonable without concrete evidence of a violation of the law. Upon becoming aware of legal violations, we will remove such links immediately.",
    "copyright": "Copyright",
    "copyright_text": "The content and works created by the site operators on these pages are subject to German copyright law. The duplication, processing, distribution, and any kind of exploitation outside the limits of copyright law require the written consent of the respective author or creator. Downloads and copies of this site are only permitted for private, non-commercial use. Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected. In particular, third-party content is marked as such. Should you nevertheless become aware of a copyright infringement, please inform us accordingly. Upon becoming aware of legal violations, we will remove such content immediately.",
    "source": "Imprint from the",
    "generator": "Imprint Generator",
    "of": "of the"
  },
  "privacy-policy": {
    "headline": "Data Policy"
  }
}
